backend/controllers/ProductsImagesController.php

SELECT * FROM `products_images` WHERE `id`='87635'
---
    protected function findModel($id)
    {
        if (($model = ProductsImages::findOne($id)) !== null) {