backend/controllers/ProductsFiltersController.php

    public function actionCreate()
    {
        $aProductsFilters =[0];
        $model = new ProductsFilters();
        $oFiltersGroup = new FiltersGroup();
        $oFilters = new Filters();
        $aFiltersGroup = $oFiltersGroup::find()->where(['is_active'=> 1])->orderBy('sort_order')->all();
---
SELECT * FROM `filters_group` WHERE `is_active`=1 ORDER BY `sort_order`