backend/controllers/ProductsController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $oProductsDescription = ProductsDescripton::findOne($model->id, 1);
---
SELECT * FROM `products_descripton` WHERE `products_id`=5

    protected function findModel($id)
    {
        if (($model = Products::findOne($id)) !== null) {
---
SELECT * FROM `products` WHERE `id`='2'