backend/controllers/ProductsAttributesController.php

SELECT * FROM `attributes` ORDER BY `sort_order`
SELECT * FROM `products_attributes` WHERE `products_id`='5518'
---
    public function actionCreate()
    {
        $model = new ProductsAttributes();
        $aProductsAttributes = [0=>0];
        $oAttributes = new Attributes();
        $aAttributes = $oAttributes::find()->indexBy('id')->orderBy('sort_order')->all();
        $model->products_id = $_GET['id'];
        $oProductsAttributes = $model->find()->where(['products_id' => $model->products_id])->all();