backend/views/products/_form.php

    <?= $form->field($oPD, 'meta_title', ['labelOptions' => ['class'=>'col-sm-2']])->textInput() ?>
    <?= $form->field($oPD, 'meta_description', ['labelOptions' => ['class'=>'col-sm-2']])->textInput() ?>
    <?= $form->field($oPD, 'meta_keywords', ['labelOptions' => ['class'=>'col-sm-2']])->textInput() ?>
    <?= $form->field($model, 'producers_id',['labelOptions' => ['class'=>'col-sm-2']])->dropDownList(ArrayHelper::map(Producers::find()->all(), 'id', 'name'), ['prompt' => '-=Dostawca=-'])?>


    <?= $form->field($model, 'vats_id', ['labelOptions' => ['class'=>'col-sm-2']])->dropDownList(ArrayHelper::map(Vats::find()->all(), 'id', 'name'), ['prompt' => '-=Vat=-'])?>
---
SELECT * FROM `producers`
SELECT * FROM `vats`