backend/views/products/index.php

SELECT * FROM `producers`
SELECT * FROM `vats` ORDER BY `id` DESC
---
            ],
            //'sort_order',
            //'producers_id',
            [
                'attribute' => 'producers_id',
                'value' =>  'producers.name',
                'filter' => Html::activeDropDownList($searchModel, 'producers_id', ArrayHelper::map(app\models\Producers::find()->asArray()->all(), 'id', 'name'),['class'=>'form-control','prompt' => 'Wybierz']),
            ],
            //'pkwiu',
            [
                'attribute' => 'vats_id',
                'value' =>  'vats.name',
                'filter' => Html::activeDropDownList($searchModel, 'vats_id', ArrayHelper::map(\app\models\Vats::find()->orderBy('id DESC')->asArray()->all(), 'id', 'name'),['class'=>'form-control','prompt' => 'Wybierz']),
            ],