backend/views/products-images/_form.php

SELECT * FROM `image_type`
---

    <?= $form->field($model, 'products_id')->textInput() ?>
    <?= $form->field($model, 'description')->textInput(['maxlength' => true]) ?>
    <?= $form->field($model, 'image_type_id')->dropDownList(ArrayHelper::map(ImageType::find()->all(), 'id', 'name'), ['prompt' => '-=Rodzaj zdjęcia=-'])?>