backend/models/ProductsFiltersQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `products_filters` WHERE `products_id`='5518'